Процедура ОбработкаПроведения(Отказ,Режим)

	// регистр ОстаткиТоваров
	Движения.ОстаткиТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаТовары из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Колличество = ТекСтрокаТовары.Колличество;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
	КонецЦикла;

	// регистр РегистрыБухУчёт
	Движения.РегистрыБухУчёт.Записывать = Истина;
	Движение = Движения.РегистрыБухУчёт.Добавить();
	Движение.Период = Дата;
	Движение.СчетДт = ПланыСчетов.БухУчёт.Товары;
	Движение.СчетКт = ПланыСчетов.БухУчёт.РасчётыСПоставщиками;
	Движение.Сумма = СуммаДокумента;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СуммаДокумента = Товары.Итог("сумма");
	КонецПроцедуры