Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РегистрыБухУчётОстатки.Счет,
		|	РегистрыБухУчётОстатки.СуммаОстатокДт,
		|	РегистрыБухУчётОстатки.СуммаОстатокКт
		|ИЗ
		|	РегистрБухгалтерии.РегистрыБухУчёт.Остатки(&МоментВремени, Счет В (&СчётВыручка, &СчётСебестоимость),) КАК
		|		РегистрыБухУчётОстатки";
	
	Запрос.УстановитьПараметр("СчётВыручка", ПланыСчетов.БухУчёт.Выручка);
	Запрос.УстановитьПараметр("СчётСебестоимость", ПланыСчетов.БухУчёт.Себестоимость);
	Запрос.УстановитьПараметр("МоментВремени", КонецМесяца(Дата)+1);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СуммаВыручки = 0;
	СуммаСебестоимости = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.Счёт = ПланыСчетов.БухУчёт.Выручка Тогда
			СуммаВыручки = ВыборкаДетальныеЗаписи.СуммаОстатокКт;
		ИначеЕсли ВыборкаДетальныеЗаписи.Счёт = ПланыСчетов.БухУчёт.Себестоимость Тогда
			СуммаСебестоимости = ВыборкаДетальныеЗаписи.СуммаОстатокДт;
			КонецЕсли;
		
	КонецЦикла;
	
	Движения.РегистрыБухУчёт.Записывать = Истина;
	
	Проводка = Движения.РегистрыБухУчёт.Добавить();
	Проводка.Период = Дата;
	Проводка.СчетДт = ПланыСчетов.БухУчёт.Выручка;
	Проводка.СчетКт = ПланыСчетов.БухУчёт.ПрибылиИУбытки;
	Проводка.Сумма = СуммаВыручки;
	
	Проводка = Движения.РегистрыБухУчёт.Добавить();
	Проводка.Период = Дата;
	Проводка.СчетДт = ПланыСчетов.БухУчёт.ПрибылиИУбытки;
	Проводка.СчетКт = ПланыСчетов.БухУчёт.Себестоимость;
	Проводка.Сумма = СуммаСебестоимости;
	КонецПроцедуры